src/cf/Catalogs/НастройкиПодключенияRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияRabbitMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НастройкиПодключенияRabbitMQ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыНастроекПоУмолчанию() Экспорт
	
	Возврат ПараметрыНастроек(Справочники.НастройкиПодключенияRabbitMQ.Основная);
	
КонецФункции

Функция ПараметрыНастроек(Настройка) Экспорт
	
	ПараметрыНастроек = Новый Структура;
	ПараметрыНастроек.Вставить("АдресСервера");
	ПараметрыНастроек.Вставить("Хост");
	ПараметрыНастроек.Вставить("Очередь");
	ПараметрыНастроек.Вставить("ИмяПользователя");
	ПараметрыНастроек.Вставить("Пароль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияRabbitMQ.АдресСервера КАК АдресСервера,
		|	НастройкиПодключенияRabbitMQ.Хост КАК Хост,
		|	НастройкиПодключенияRabbitMQ.Очередь КАК Очередь,
		|	НастройкиПодключенияRabbitMQ.ИмяПользователя КАК ИмяПользователя,
		|	НастройкиПодключенияRabbitMQ.Пароль КАК Пароль
		|ИЗ
		|	Справочник.НастройкиПодключенияRabbitMQ КАК НастройкиПодключенияRabbitMQ
		|ГДЕ
		|	НастройкиПодключенияRabbitMQ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыНастроек, Выборка)
	КонецЕсли;
	
	Возврат ПараметрыНастроек;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
